OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1778.h
#define _DAC5CON2_REF8          0x01
#define _DAC5CON2_DAC5REF8      0x01
#define _DAC5CON2_R8            0x01
#define _DAC5CON2_DAC5R8        0x01
#define _DAC5CON2_REF9          0x02
#define _DAC5CON2_DAC5REF9      0x02
#define _DAC5CON2_R9            0x02
#define _DAC5CON2_DAC5R9        0x02
#define _DAC5CON2_REF10         0x04
#define _DAC5CON2_DAC5REF10     0x04
#define _DAC5CON2_R10           0x04
#define _DAC5CON2_DAC5R10       0x04
#define _DAC5CON2_REF11         0x08
#define _DAC5CON2_DAC5REF11     0x08
#define _DAC5CON2_R11           0x08
#define _DAC5CON2_DAC5R11       0x08
#define _DAC5CON2_REF12         0x10
#define _DAC5CON2_DAC5REF12     0x10
#define _DAC5CON2_R12           0x10
#define _DAC5CON2_DAC5R12       0x10
#define _DAC5CON2_REF13         0x20
#define _DAC5CON2_DAC5REF13     0x20
#define _DAC5CON2_R13           0x20
#define _DAC5CON2_DAC5R13       0x20
#define _DAC5CON2_REF14         0x40
#define _DAC5CON2_DAC5REF14     0x40
#define _DAC5CON2_R14           0x40
#define _DAC5CON2_DAC5R14       0x40
#define _DAC5CON2_REF15         0x80
#define _DAC5CON2_DAC5REF15     0x80
#define _DAC5CON2_R15           0x80
#define _DAC5CON2_DAC5R15       0x80

//==============================================================================


//==============================================================================
//        DAC5REFH Bits

extern __at(0x059A) __sfr DAC5REFH;

typedef union
  {
  struct
    {
    unsigned REF8               : 1;
    unsigned REF9               : 1;
    unsigned REF10              : 1;
    unsigned REF11              : 1;
    unsigned REF12              : 1;
    unsigned REF13              : 1;
    unsigned REF14              : 1;
    unsigned REF15              : 1;
    };

  struct
    {
    unsigned DAC5REF8           : 1;
    unsigned DAC5REF9           : 1;
    unsigned DAC5REF10          : 1;
    unsigned DAC5REF11          : 1;
    unsigned DAC5REF12          : 1;
    unsigned DAC5REF13          : 1;
    unsigned DAC5REF14          : 1;
    unsigned DAC5REF15          : 1;
    };

  struct
    {
    unsigned R8                 : 1;
    unsigned R9                 : 1;
    unsigned R10                : 1;
    unsigned R11                : 1;
    unsigned R12                : 1;
    unsigned R13                : 1;
    unsigned R14                : 1;
    unsigned R15                : 1;
    };

  struct
    {
    unsigned DAC5R8             : 1;
    unsigned DAC5R9             : 1;
    unsigned DAC5R10            : 1;
    unsigned DAC5R11            : 1;
    unsigned DAC5R12            : 1;
    unsigned DAC5R13            : 1;
    unsigned DAC5R14            : 1;
    unsigned DAC5R15            : 1;
    };
  } __DAC5REFHbits_t;

extern __at(0x059A) volatile __DAC5REFHbits_t DAC5REFHbits;

#define _DAC5REFH_REF8          0x01
#define _DAC5REFH_DAC5REF8      0x01
#define _DAC5REFH_R8            0x01
#define _DAC5REFH_DAC5R8        0x01
#define _DAC5REFH_REF9          0x02
#define _DAC5REFH_DAC5REF9      0x02
#define _DAC5REFH_R9            0x02
#define _DAC5REFH_DAC5R9        0x02
#define _DAC5REFH_REF10         0x04
#define _DAC5REFH_DAC5REF10     0x04
#define _DAC5REFH_R10           0x04
#define _DAC5REFH_DAC5R10       0x04
#define _DAC5REFH_REF11         0x08
#define _DAC5REFH_DAC5REF11     0x08
#define _DAC5REFH_R11           0x08
#define _DAC5REFH_DAC5R11       0x08
#define _DAC5REFH_REF12         0x10
#define _DAC5REFH_DAC5REF12     0x10
#define _DAC5REFH_R12           0x10
#define _DAC5REFH_DAC5R12       0x10
#define _DAC5REFH_REF13         0x20
#define _DAC5REFH_DAC5REF13     0x20
#define _DAC5REFH_R13           0x20
#define _DAC5REFH_DAC5R13       0x20
#define _DAC5REFH_REF14         0x40
#define _DAC5REFH_DAC5REF14     0x40
#define _DAC5REFH_R14           0x40
#define _DAC5REFH_DAC5R14       0x40
#define _DAC5REFH_REF15         0x80
#define _DAC5REFH_DAC5REF15     0x80
#define _DAC5REFH_R15           0x80
#define _DAC5REFH_DAC5R15       0x80

//==============================================================================


//==============================================================================
//        DAC7CON0 Bits

extern __at(0x059E) __sfr DAC7CON0;

typedef union
  {
  struct
    {
    unsigned NSS0               : 1;
    unsigned NSS1               : 1;
    unsigned PSS0               : 1;
    unsigned PSS1               : 1;
    unsigned OE2                : 1;
    unsigned OE1                : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned DACNSS0            : 1;
    unsigned DACNSS1            : 1;
    unsigned DACPSS0            : 1;
    unsigned DACPSS1            : 1;
    unsigned DACOE2             : 1;
    unsigned DACOE1             : 1;
    unsigned                    : 1;
    unsigned DACEN              : 1;
    };

  struct
    {
    unsigned DAC7NSS0           : 1;
    unsigned DAC7NSS1           : 1;
    unsigned DAC7PSS0           : 1;
    unsigned DAC7PSS1           : 1;
    unsigned DAC7OE2            : 1;
    unsigned DAC7OE1            : 1;
    unsigned                    : 1;
    unsigned DAC7EN             : 1;
    };

  struct
    {
    unsigned DAC7NSS            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned DACNSS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned NSS                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PSS                : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned DACPSS             : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned DAC7PSS            : 2;
    unsigned                    : 4;
    };
  } __DAC7CON0bits_t;

extern __at(0x059E) volatile __DAC7CON0bits_t DAC7CON0bits;

#define _DAC7CON0_NSS0          0x01
#define _DAC7CON0_DACNSS0       0x01
#define _DAC7CON0_DAC7NSS0      0x01
#define _DAC7CON0_NSS1          0x02
#define _DAC7CON0_DACNSS1       0x02
#define _DAC7CON0_DAC7NSS1      0x02
#define _DAC7CON0_PSS0          0x04
#define _DAC7CON0_DACPSS0       0x04
#define _DAC7CON0_DAC7PSS0      0x04
#define _DAC7CON0_PSS1          0x08
#define _DAC7CON0_DACPSS1       0x08
#define _DAC7CON0_DAC7PSS1      0x08
#define _DAC7CON0_OE2           0x10
#define _DAC7CON0_DACOE2        0x10
#define _DAC7CON0_DAC7OE2       0x10
#define _DAC7CON0_OE1           0x20
#define _DAC7CON0_DACOE1        0x20
#define _DAC7CON0_DAC7OE1       0x20
#define _DAC7CON0_EN            0x80
#define _DAC7CON0_DACEN         0x80
#define _DAC7CON0_DAC7EN        0x80

//==============================================================================


//==============================================================================
//        DAC7CON1 Bits

extern __at(0x059F) __sfr DAC7CON1;

typedef union
  {
  struct
    {
    unsigned DACR0              : 1;
    unsigned DACR1              : 1;
    unsigned DACR2              : 1;
    unsigned DACR3              : 1;
    unsigned DACR4              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned R0                 : 1;
    unsigned R1                 : 1;
    unsigned R2                 : 1;
    unsigned R3                 : 1;
    unsigned R4                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC7R0             : 1;
    unsigned DAC7R1             : 1;
    unsigned DAC7R2             : 1;
    unsigned DAC7R3             : 1;
    unsigned DAC7R4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned REF0               : 1;
    unsigned REF1               : 1;
    unsigned REF2               : 1;
    unsigned REF3               : 1;
    unsigned REF4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC7REF0           : 1;
    unsigned DAC7REF1           : 1;
    unsigned DAC7REF2           : 1;
    unsigned DAC7REF3           : 1;
    unsigned DAC7REF4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DACR               : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned DAC7R              : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned DAC7REF            : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned R                  : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned REF                : 5;
    unsigned                    : 3;
    };
  } __DAC7CON1bits_t;

extern __at(0x059F) volatile __DAC7CON1bits_t DAC7CON1bits;

